{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution0_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "16", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution0_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "16", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution0", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "16", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation0", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution1_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "16", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution1_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "16", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution1", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "16", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[4, 0, 0], [5, 0, 0], [6, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution2_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution2", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[8, 0, 0], [9, 0, 0], [10, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation2", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution3_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution3_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution3", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[12, 0, 0], [13, 0, 0], [14, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation3", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution4_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution4_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution4", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[16, 0, 0], [17, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation4", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[19, 0, 0]]
    }, 
    {
      "op": "add_n", 
      "name": "elementwisesum0", 
      "attr": {"num_args": "2"}, 
      "inputs": [[20, 0, 0], [12, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution7_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution7_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution7", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[21, 0, 0], [22, 0, 0], [23, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation7", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution5_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "48", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution5_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "48", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution5", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "48", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[21, 0, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation5", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[28, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution6_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution6_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution6", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[29, 0, 0], [30, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation6", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[32, 0, 0]]
    }, 
    {
      "op": "add_n", 
      "name": "elementwisesum1", 
      "attr": {"num_args": "2"}, 
      "inputs": [[25, 0, 0], [33, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution8_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "48", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution8_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "48", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution8", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "48", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[34, 0, 0], [35, 0, 0], [36, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[37, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution9_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution9_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution9", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[38, 0, 0], [39, 0, 0], [40, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation9", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[41, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution10_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "5", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution10_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "5", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution10", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "5", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[42, 0, 0], [43, 0, 0], [44, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    5, 
    6, 
    9, 
    10, 
    13, 
    14, 
    17, 
    18, 
    22, 
    23, 
    26, 
    27, 
    30, 
    31, 
    35, 
    36, 
    39, 
    40, 
    43, 
    44
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46
  ], 
  "heads": [[45, 0, 0]], 
  "attrs": {
    "build_version": ["str", "nnvm_0.0.2 commit 5712fb7e0599890d956ad96c96f697e3bab93a62 Author: Lichao Huang <365422537@qq.com> Date:   Fri Mar 2 19:51:40 2018 +0800"], 
    "mxnet_version": ["int", 10001]
  }
}