{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution0_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "8", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution0_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "8", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution0", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "8", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm0", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 1], [7, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation0", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution1_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "8", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution1_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "8", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution1", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "8", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[9, 0, 0], [10, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm1", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[12, 0, 0], [13, 0, 0], [14, 0, 0], [15, 0, 1], [16, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "16", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution2_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "16", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution2", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "16", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[18, 0, 0], [19, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm2_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm2_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm2_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm2_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm2", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[21, 0, 0], [22, 0, 0], [23, 0, 0], [24, 0, 1], [25, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation2", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[26, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution3_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution3_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution3", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[27, 0, 0], [28, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm3_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm3_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm3_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm3_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm3", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[30, 0, 0], [31, 0, 0], [32, 0, 0], [33, 0, 1], [34, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation3", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[35, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution4_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution4_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution4", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[36, 0, 0], [37, 0, 0], [38, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm4_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm4_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm4_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm4_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm4", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[39, 0, 0], [40, 0, 0], [41, 0, 0], [42, 0, 1], [43, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation4", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[44, 0, 0]]
    }, 
    {
      "op": "add_n", 
      "name": "elementwisesum0", 
      "attr": {"num_args": "2"}, 
      "inputs": [[45, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution7_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "16", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution7_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "16", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution7", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "16", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[46, 0, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm7_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm7_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm7_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm7_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm7", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[49, 0, 0], [50, 0, 0], [51, 0, 0], [52, 0, 1], [53, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation7", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[54, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution5_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "24", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution5_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "24", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution5", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "24", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[46, 0, 0], [56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm5_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm5_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm5_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm5_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm5", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[58, 0, 0], [59, 0, 0], [60, 0, 0], [61, 0, 1], [62, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation5", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[63, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution6_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution6_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution6", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[64, 0, 0], [65, 0, 0], [66, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm6_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm6_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm6_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm6_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm6", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[67, 0, 0], [68, 0, 0], [69, 0, 0], [70, 0, 1], [71, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation6", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[72, 0, 0]]
    }, 
    {
      "op": "add_n", 
      "name": "elementwisesum1", 
      "attr": {"num_args": "2"}, 
      "inputs": [[55, 0, 0], [73, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution8_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "24", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution8_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "24", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution8", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "24", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[74, 0, 0], [75, 0, 0], [76, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm8_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm8_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm8_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm8_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm8", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[77, 0, 0], [78, 0, 0], [79, 0, 0], [80, 0, 1], [81, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[82, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution9_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "48", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution9_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "48", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution9", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "48", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[83, 0, 0], [84, 0, 0], [85, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm9_gamma", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm9_beta", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm9_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm9_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm9", 
      "attr": {
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[86, 0, 0], [87, 0, 0], [88, 0, 0], [89, 0, 1], [90, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation9", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[91, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution10_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "5", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution10_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "5", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution10", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "5", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[92, 0, 0], [93, 0, 0], [94, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    4, 
    5, 
    6, 
    7, 
    10, 
    11, 
    13, 
    14, 
    15, 
    16, 
    19, 
    20, 
    22, 
    23, 
    24, 
    25, 
    28, 
    29, 
    31, 
    32, 
    33, 
    34, 
    37, 
    38, 
    40, 
    41, 
    42, 
    43, 
    47, 
    48, 
    50, 
    51, 
    52, 
    53, 
    56, 
    57, 
    59, 
    60, 
    61, 
    62, 
    65, 
    66, 
    68, 
    69, 
    70, 
    71, 
    75, 
    76, 
    78, 
    79, 
    80, 
    81, 
    84, 
    85, 
    87, 
    88, 
    89, 
    90, 
    93, 
    94
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    67, 
    68, 
    69, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    78, 
    79, 
    80, 
    81, 
    82, 
    83, 
    84, 
    85, 
    86, 
    89, 
    90, 
    91, 
    92, 
    93, 
    94, 
    95, 
    96, 
    97, 
    98, 
    101, 
    102, 
    103, 
    104, 
    105, 
    106, 
    107, 
    108, 
    109, 
    112, 
    113, 
    114, 
    115, 
    116
  ], 
  "heads": [[95, 0, 0]], 
  "attrs": {
    "build_version": ["str", "nnvm_0.0.2 commit 5712fb7e0599890d956ad96c96f697e3bab93a62 Author: Lichao Huang <365422537@qq.com> Date:   Fri Mar 2 19:51:40 2018 +0800"], 
    "mxnet_version": ["int", 10001]
  }
}