{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_conv1_3x3_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "48", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_conv1_3x3_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "48", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_conv1_3x3", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "48", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_conv1_3x3_gamma", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv1_3x3_beta", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv1_3x3_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv1_3x3_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_conv1_3x3", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 1], [7, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_conv1_3x3", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_conv3_block_3x3_reduce_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "12", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_conv3_block_3x3_reduce_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "12", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_conv3_block_3x3_reduce", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "12", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[9, 0, 0], [10, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_conv3_block_3x3_reduce_gamma", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv3_block_3x3_reduce_beta", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv3_block_3x3_reduce_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv3_block_3x3_reduce_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_conv3_block_3x3_reduce", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[12, 0, 0], [13, 0, 0], [14, 0, 0], [15, 0, 1], [16, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_conv3_block_3x3_reduce", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_conv3_block_3x3_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "24", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_conv3_block_3x3_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "24", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_conv3_block_3x3", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "24", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[18, 0, 0], [19, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_conv3_block_3x3_gamma", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv3_block_3x3_beta", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv3_block_3x3_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv3_block_3x3_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_conv3_block_3x3", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[21, 0, 0], [22, 0, 0], [23, 0, 0], [24, 0, 1], [25, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_conv3_block_3x3", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[26, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_conv3_block_double_3x3_reduce_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "8", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_conv3_block_double_3x3_reduce_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "8", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_conv3_block_double_3x3_reduce", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "8", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[9, 0, 0], [28, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_conv3_block_double_3x3_reduce_gamma", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv3_block_double_3x3_reduce_beta", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv3_block_double_3x3_reduce_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv3_block_double_3x3_reduce_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_conv3_block_double_3x3_reduce", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[30, 0, 0], [31, 0, 0], [32, 0, 0], [33, 0, 1], [34, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_conv3_block_double_3x3_reduce", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[35, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_conv3_block_double_3x3_0_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_conv3_block_double_3x3_0_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_conv3_block_double_3x3_0", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[36, 0, 0], [37, 0, 0], [38, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_conv3_block_double_3x3_0_gamma", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv3_block_double_3x3_0_beta", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv3_block_double_3x3_0_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv3_block_double_3x3_0_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_conv3_block_double_3x3_0", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[39, 0, 0], [40, 0, 0], [41, 0, 0], [42, 0, 1], [43, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_conv3_block_double_3x3_0", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[44, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_conv3_block_double_3x3_1_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "16", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_conv3_block_double_3x3_1_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "16", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_conv3_block_double_3x3_1", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "16", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[45, 0, 0], [46, 0, 0], [47, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_conv3_block_double_3x3_1_gamma", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv3_block_double_3x3_1_beta", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv3_block_double_3x3_1_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv3_block_double_3x3_1_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_conv3_block_double_3x3_1", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[48, 0, 0], [49, 0, 0], [50, 0, 0], [51, 0, 1], [52, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_conv3_block_double_3x3_1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[53, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "max_pool_conv3_block_pool", 
      "attr": {
        "kernel": "(3, 3)", 
        "pad": "(0, 0)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_max_pool_conv3_block_pool_reduce_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "24", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_max_pool_conv3_block_pool_reduce_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "24", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_max_pool_conv3_block_pool_reduce", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "24", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[55, 0, 0], [56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_max_pool_conv3_block_pool_reduce_gamma", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_max_pool_conv3_block_pool_reduce_beta", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_max_pool_conv3_block_pool_reduce_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_max_pool_conv3_block_pool_reduce_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_max_pool_conv3_block_pool_reduce", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[58, 0, 0], [59, 0, 0], [60, 0, 0], [61, 0, 1], [62, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_max_pool_conv3_block_pool_reduce", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[63, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "ch_concat_conv3_block_chconcat", 
      "attr": {"num_args": "3"}, 
      "inputs": [[27, 0, 0], [54, 0, 0], [64, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_conv4_block_3x3_reduce_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "16", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_conv4_block_3x3_reduce_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "16", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_conv4_block_3x3_reduce", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "16", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[65, 0, 0], [66, 0, 0], [67, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_conv4_block_3x3_reduce_gamma", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv4_block_3x3_reduce_beta", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv4_block_3x3_reduce_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv4_block_3x3_reduce_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_conv4_block_3x3_reduce", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[68, 0, 0], [69, 0, 0], [70, 0, 0], [71, 0, 1], [72, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_conv4_block_3x3_reduce", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[73, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_conv4_block_3x3_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "72", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_conv4_block_3x3_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "72", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_conv4_block_3x3", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "72", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[74, 0, 0], [75, 0, 0], [76, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_conv4_block_3x3_gamma", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv4_block_3x3_beta", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv4_block_3x3_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_conv4_block_3x3_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_conv4_block_3x3", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[77, 0, 0], [78, 0, 0], [79, 0, 0], [80, 0, 1], [81, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_conv4_block_3x3", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[82, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "max_pool_conv4_block_pool", 
      "attr": {
        "kernel": "(3, 3)", 
        "pad": "(0, 0)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[65, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_max_pool_conv4_block_pool_reduce_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "72", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_max_pool_conv4_block_pool_reduce_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "72", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_max_pool_conv4_block_pool_reduce", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "72", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[84, 0, 0], [85, 0, 0], [86, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_max_pool_conv4_block_pool_reduce_gamma", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_max_pool_conv4_block_pool_reduce_beta", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_max_pool_conv4_block_pool_reduce_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_max_pool_conv4_block_pool_reduce_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_max_pool_conv4_block_pool_reduce", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[87, 0, 0], [88, 0, 0], [89, 0, 0], [90, 0, 1], [91, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_max_pool_conv4_block_pool_reduce", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[92, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "ch_concat_conv4_block_chconcat", 
      "attr": {"num_args": "2"}, 
      "inputs": [[83, 0, 0], [93, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_con5_block_3x3_reduce_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "48", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_con5_block_3x3_reduce_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "48", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_con5_block_3x3_reduce", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "48", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[94, 0, 0], [95, 0, 0], [96, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_con5_block_3x3_reduce_gamma", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_con5_block_3x3_reduce_beta", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_con5_block_3x3_reduce_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_con5_block_3x3_reduce_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_con5_block_3x3_reduce", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[97, 0, 0], [98, 0, 0], [99, 0, 0], [100, 0, 1], [101, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_con5_block_3x3_reduce", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[102, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_con5_block_3x3_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "144", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_con5_block_3x3_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "144", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_con5_block_3x3", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "144", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[103, 0, 0], [104, 0, 0], [105, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_con5_block_3x3_gamma", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_con5_block_3x3_beta", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_con5_block_3x3_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_con5_block_3x3_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_con5_block_3x3", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[106, 0, 0], [107, 0, 0], [108, 0, 0], [109, 0, 1], [110, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_con5_block_3x3", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[111, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "max_pool_con5_block_pool", 
      "attr": {
        "kernel": "(3, 3)", 
        "pad": "(0, 0)", 
        "pool_type": "avg", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[94, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_max_pool_con5_block_pool_reduce_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "144", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_max_pool_con5_block_pool_reduce_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "144", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_max_pool_con5_block_pool_reduce", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "144", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[113, 0, 0], [114, 0, 0], [115, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn_max_pool_con5_block_pool_reduce_gamma", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_max_pool_con5_block_pool_reduce_beta", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_max_pool_con5_block_pool_reduce_moving_mean", 
      "attr": {
        "__init__": "[\"zero\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_max_pool_con5_block_pool_reduce_moving_var", 
      "attr": {
        "__init__": "[\"one\", {}]", 
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_max_pool_con5_block_pool_reduce", 
      "attr": {
        "eps": "1.00001e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[116, 0, 0], [117, 0, 0], [118, 0, 0], [119, 0, 1], [120, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu_max_pool_con5_block_pool_reduce", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[121, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "ch_concat_con5_block_chconcat", 
      "attr": {"num_args": "2"}, 
      "inputs": [[112, 0, 0], [122, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten", 
      "inputs": [[123, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc_class_score_weight", 
      "attr": {"num_hidden": "2"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc_class_score_bias", 
      "attr": {"num_hidden": "2"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc_class_score", 
      "attr": {"num_hidden": "2"}, 
      "inputs": [[124, 0, 0], [125, 0, 0], [126, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "softmax_label", 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "softmax", 
      "inputs": [[127, 0, 0], [128, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    4, 
    5, 
    6, 
    7, 
    10, 
    11, 
    13, 
    14, 
    15, 
    16, 
    19, 
    20, 
    22, 
    23, 
    24, 
    25, 
    28, 
    29, 
    31, 
    32, 
    33, 
    34, 
    37, 
    38, 
    40, 
    41, 
    42, 
    43, 
    46, 
    47, 
    49, 
    50, 
    51, 
    52, 
    56, 
    57, 
    59, 
    60, 
    61, 
    62, 
    66, 
    67, 
    69, 
    70, 
    71, 
    72, 
    75, 
    76, 
    78, 
    79, 
    80, 
    81, 
    85, 
    86, 
    88, 
    89, 
    90, 
    91, 
    95, 
    96, 
    98, 
    99, 
    100, 
    101, 
    104, 
    105, 
    107, 
    108, 
    109, 
    110, 
    114, 
    115, 
    117, 
    118, 
    119, 
    120, 
    125, 
    126, 
    128
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    66, 
    67, 
    68, 
    69, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    78, 
    79, 
    80, 
    81, 
    82, 
    83, 
    84, 
    85, 
    86, 
    87, 
    90, 
    91, 
    92, 
    93, 
    94, 
    95, 
    96, 
    97, 
    98, 
    101, 
    102, 
    103, 
    104, 
    105, 
    106, 
    107, 
    108, 
    109, 
    110, 
    113, 
    114, 
    115, 
    116, 
    117, 
    118, 
    119, 
    120, 
    121, 
    122, 
    125, 
    126, 
    127, 
    128, 
    129, 
    130, 
    131, 
    132, 
    133, 
    136, 
    137, 
    138, 
    139, 
    140, 
    141, 
    142, 
    143, 
    144, 
    145, 
    148, 
    149, 
    150, 
    151, 
    152, 
    153, 
    154, 
    155, 
    156
  ], 
  "heads": [[129, 0, 0]], 
  "attrs": {
    "build_version": ["str", "nnvm_1.3.0 commit d99840f9cbcb2e0c642da5f6b602bad8ae875726 Author: Lichao.Huang <lichao.huang@hobot.cc> Date:   Wed Nov 28 14:59:11 2018 +0800"], 
    "mxnet_version": ["int", 10300]
  }
}